<script setup lang="ts">
import DefaultLayout from '@/layout/DefaultLayout.vue'
</script>

<template>
  <DefaultLayout class="blog-content">
    <div>
      <h1>Рекомендации</h1>
      <h3>Для разработки веб-приложении на фреймворке Vue</h3>
    </div>

    <div :style="{ marginTop: '40px' }">
      <h4>Использование Vue Router</h4>
      <p class="text-block">
        Для управления роутингом в приложении необходимо использовать библиотеку
        Vue Router, которая предоставляет удобный и понятный программный
        интерфейс. Для каждой отдельной страницы следует создавать отдельный
        корневой компонент, который будет вставляться в слот компонента
        RouterView.
        <br />
        <br />
        RouterView следует создавать в корневом компоненте приложения Vue,
        который используется в экземпляре приложения Vue при инициализации. Тут
        же следует подключать общие методы и общие компоненты, которые
        используются на всех страницах, например лейауты, диалоговые окна,
        контекстные меню и т.д.
        <br />
        <br />
        Общие скрипты, которые исполняются перед загрузкой очередного роута при
        навигации, например проверку доступа пользователя к запрошенной странице
        или отправку данных в программу для сбора аналитических данных, следует
        выносить в навигационный хуки beforeEach или beforeResolve,
        предоставляемые библиотекой.
      </p>
    </div>
    <div :style="{ marginTop: '40px' }">
      <h4>Использование стейт-менеджеров</h4>
      <p class="text-block">
        При небольшой логике приложения использование библиотек для управления
        состояниями является избыточном, так как можно обойтись компоузами с
        переменной-хранилищем во внешней области видимости. А для передачи
        данных между родительскими и дочерними компонентами глубокой степени
        вложенности стоит использовать provide/inject методы.
        <br />
        <br />
        Однако, если есть необходимость в применения библиотек хранилищ
        состояний, либо же приложение содержит сложную, объемную, разветвленную
        логику по работе с данными, то стоит отдавать предпочтение в выборе
        библиотеки Pinia. Ее возможности по созданию модульных хранилищ не
        только хорошо сочетаются с идеологией компоузов во Vue 3, но и позволяют
        легко воплощать модульный архитектурный подход.
        <br />
        <br />
        Применять Vuex стоит только при невозможности работы с Pinia, либо при
        использовании Vue второй версии.
      </p>
    </div>
    <div :style="{ marginTop: '40px' }">
      <h4>Использование NUXT</h4>
      <p class="text-block">
        Если для приложения не требуются хорошая оптимизация поисковыми
        роботами, например при создании таких проектов как административная
        панель, внутренний интерфейс управления личным кабинетом, встраиваемое
        приложение и т.п. следует выбирать в качестве основного фреймворка Vue с
        библиотекой Vue Router.
        <br />
        А при создании таких приложений, как интернет-магазин, новостное
        приложение, блог и т.п. следует использовать Nuxt из-за возможностей
        серверной генерации и прегенерации контента
      </p>
    </div>
    <div :style="{ marginTop: '40px' }">
      <h4>Стилизация</h4>
      <p class="text-block">
        Так как Vue отлично поддерживает работу с препроцессорами стилей SASS,
        SCSS, LESS, а также CSS, с поддержкой css-модулей, то в большинстве
        случаев использование дополнительных библиотек для UI не требуется.
        <br />
        <br />
        Однако же для ускорения разработки приложения можно включить в конечный
        бандл такие библиотеки как PrimeVue и HeadlessUI. Эти библиотеки
        представляют готовые UI компоненты в виде «каркаса», позволяя гибко
        настраивать их внешний вид. В связке с TailwindCSS, который позволяет
        писать атомарные классы для стилизации, разработка проекта существенно
        ускоряется.
      </p>
    </div>
    <div :style="{ marginTop: '40px' }">
      <h4>Архитектура</h4>
      <p class="text-block">
        Архитектура приложения должна выбираться основываясь на потребности
        конечного приложения, но как универсальное решение стоит отдавать
        предпочтение архитектурам имеющим в основе модульный подход инкапсуляции
        внутренних данных и методов.
        <br />
        <br />
        Привнесенные третьей версией Vue компоузы позволяют вынести логику по
        работе с данными в отдельную функцию, которую можно переиспользовать в
        разных частях приложения, не заботясь о внутреннем устройстве, а имея
        только внешний интерфейс. Использование в совокупности с использованием
        контейнерных и презентационных компонентов такой подход является
        довольно мощным инструментом.
      </p>
    </div>
    <div :style="{ marginTop: '40px' }">
      <h4>Библиотеки</h4>
      <ul>
        <li>
          <a href="https://router.vuejs.org/" target="_blank">Vue Router</a>
        </li>
        <li>
          <a href="https://pinia.vuejs.org/" target="_blank">Pinia</a>
        </li>
        <li>
          <a href="https://vuex.vuejs.org/" target="_blank">Vuex</a>
        </li>
        <li>
          <a href="https://nuxt.com/" target="_blank">NUXT</a>
        </li>
        <li><a href="https://primevue.org/" target="_blank">PrimeVue</a></li>
        <li>
          <a href="https://headlessui.com/v1/vue" target="_blank">HeadlessUI</a>
        </li>
      </ul>
    </div>
  </DefaultLayout>
</template>
